       01  :PREF:-HWIO.
           05 :PREF:-HWIO-PORT PIC 9(4).
           05 :PREF:-HWIO-DATA PIC 9(4).
           05 :PREF:-HWIO-MODE PIC 9(4).
               88 :PREF:-HWIO-MODE-IN VALUE 1.
               88 :PREF:-HWIO-MODE-OUT VALUE 2.
           05 :PREF:-HWIO-SIZE PIC 9(4).
               88 :PREF:-HWIO-SIZE-8 VALUE 8.
               88 :PREF:-HWIO-SIZE-16 VALUE 16.
               88 :PREF:-HWIO-SIZE-32 VALUE 32.
               88 :PREF:-HWIO-SIZE-64 VALUE 64.
