      ******************************************************************
      * TEMPLATE - Quick template for new programs
      ******************************************************************
       IDENTIFICATION DIVISION.
       PROGRAM-ID. NAME.
       ENVIRONMENT DIVISION.
       CONFIGURATION SECTION.
       SPECIAL-NAMES.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       LINKAGE SECTION.
       PROCEDURE DIVISION.
           GOBACK.
       END PROGRAM NAME.
